<!-- Levels -->
<section class="py-12 md:py-24 text-white bg-blue-500 relative">
  <!-- WavySectionEdge -->
  <svg class="fill-blue-500 absolute bottom-full left-0 w-full z-10" aria-hidden="true" focusable="false" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1920 55">
    <path d="M1889.834 40.831c-14.51 0-21.861-6.63-28.971-13.043-7.29-6.575-14.175-12.785-28.301-12.785s-21.012 6.21-28.301 12.785c-7.109 6.413-14.461 13.043-28.971 13.043s-21.86-6.63-28.97-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.01 6.21-28.299 12.785c-7.108 6.413-14.46 13.043-28.969 13.043s-21.859-6.63-28.968-13.043c-7.289-6.575-14.174-12.785-28.298-12.785s-21.01 6.21-28.299 12.785c-7.109 6.413-14.46 13.043-28.97 13.043s-21.858-6.63-28.967-13.042c-7.289-6.575-14.174-12.786-28.298-12.786s-21.011 6.21-28.3 12.785c-7.109 6.413-14.461 13.043-28.971 13.043s-21.86-6.63-28.97-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.011 6.21-28.3 12.785c-7.109 6.413-14.46 13.043-28.97 13.043s-21.86-6.63-28.97-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.011 6.21-28.3 12.786c-7.109 6.412-14.46 13.042-28.969 13.042s-21.86-6.63-28.97-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.011 6.21-28.3 12.785c-7.109 6.413-14.46 13.043-28.97 13.043s-21.859-6.63-28.969-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.011 6.21-28.3 12.785c-7.109 6.413-14.46 13.043-28.97 13.043s-21.86-6.63-28.969-13.043c-7.289-6.575-14.174-12.785-28.299-12.785s-21.009 6.21-28.298 12.785c-7.108 6.413-14.459 13.043-28.968 13.043s-21.86-6.63-28.969-13.042c-7.289-6.575-14.174-12.786-28.299-12.786s-21.01 6.21-28.299 12.785c-7.109 6.413-14.46 13.043-28.969 13.043s-21.861-6.63-28.97-13.043c-7.29-6.575-14.174-12.785-28.3-12.785s-21.01 6.21-28.299 12.785c-7.109 6.413-14.46 13.043-28.97 13.043s-21.86-6.63-28.969-13.042c-7.289-6.575-14.174-12.786-28.299-12.786s-21.009 6.21-28.298 12.785c-7.109 6.413-14.459 13.043-28.969 13.043s-21.859-6.63-28.968-13.043c-7.289-6.575-14.173-12.785-28.298-12.785s-21.009 6.21-28.297 12.785c-7.109 6.413-14.459 13.043-28.968 13.043s-21.859-6.63-28.968-13.043c-7.289-6.575-14.174-12.785-28.298-12.785s-21.011 6.21-28.3 12.786c-7.109 6.412-14.46 13.042-28.969 13.042s-21.859-6.63-28.968-13.043c-7.289-6.575-14.174-12.785-28.298-12.785s-21.008 6.21-28.297 12.785c-7.108 6.413-14.459 13.043-28.967 13.043s-21.86-6.63-28.969-13.043c-7.289-6.575-14.174-12.785-28.298-12.785s-21.008 6.21-28.297 12.785c-7.108 6.413-14.459 13.043-28.967 13.043s-21.859-6.63-28.967-13.043C21.008 21.213 14.124 15.003 0 15.003V55h1920V26.713l-1.195 1.075c-7.109 6.413-14.461 13.043-28.971 13.043Z"></path>
  </svg>
  <div class="wrapper">
    <div class="box-sm">
      <!-- Heading -->
      <h2 class="heading text-center mb-12 md:mb-24">
        Выбери свой уровень
      </h2>
      <!-- Cards -->
      <div class="grid gap-12 justify-items-center md:gap-24 md:grid-cols-2">
        <!-- Card 1 -->
        <div class="relative w-full h-[260px] flex items-center group">
          <!-- BG -->
          <img src="http://happywheels.local/wp-content/uploads/2024/02/Level-1.png" alt="HappyWheels Rolling Class Level 1" class="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 h-full aspect-square object-contain object-center duration-500 group-hover:opacity-40">
          <!-- TextOnHover -->
          <p class="text-sm text-white text-center opacity-0 relative duration-500 cursor-default group-hover:opacity-100 lg:text-base">
            <strong>Уровень 1</strong>
            <br>Эти курсы и занятия подходят для абсолютных новичков, для всех, кто чувствует себя неуверенно или хочет обрести уверенность в себе. Наши инструкторы по скейтбордингу будут действовать медленно и изучат основы, следя за тем, чтобы вы чувствовали себя в безопасности и получали поддержку во время обучения ключевым навыкам катания на роликах.
            <br>
            <br>Подходит для:
            <br>• Абсолютных новичков
            <br>• Всех, кто нервничает
            <br>• Людей, которые хотят двигаться медленно.
          </p>
        </div>
        <!-- Card 2 -->
        <div class="relative w-full h-[260px] flex items-center group">
          <!-- BG -->
          <img src="http://happywheels.local/wp-content/uploads/2024/02/Level-2.png" alt="HappyWheels Rolling Class Level 1" class="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 h-full aspect-square object-contain object-center duration-500 group-hover:opacity-40">
          <!-- TextOnHover -->
          <p class="text-sm text-white text-center opacity-0 relative duration-500 cursor-default group-hover:opacity-100 lg:text-base">
            <strong>Уровень 2</strong>
            <br>Если вы умеете кататься на роликах вперед, назад и останавливаться, наши трассы второго уровня подойдут вам. На этом уровне вы освоите базовые навыки катания на роликовых коньках, которым мы обучаем на занятиях первого уровня. Если вы раньше немного катались на коньках, вы можете пройти курс второго уровня, не проходя первый уровень.
            <br>
            <br>Подходит для:
            <br>• Люди, которые немного катались на коньках
            <br>• Всем, кто хочет освежить свои навыки
            <br>• Роллеры, завершившие уровень 1.
          </p>
        </div>
        <!-- Card 3 -->
        <div class="relative w-full h-[260px] flex items-center group">
          <!-- BG -->
          <img src="http://happywheels.local/wp-content/uploads/2024/02/Level-3.png" alt="HappyWheels Rolling Class Level 1" class="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 h-full aspect-square object-contain object-center duration-500 group-hover:opacity-40">
          <!-- TextOnHover -->
          <p class="text-sm text-white text-center opacity-0 relative duration-500 cursor-default group-hover:opacity-100 lg:text-base">
            <strong>Уровень 3</strong>
            <br>Наши курсы третьего уровня созданы для того, чтобы дать вам что-то новое для работы, будь то введение в артистическое катание, новые танцевальные движения или трюки и навыки, в которых используются техники среднего уровня. Вам нужно будет уметь кататься вперед, назад, поворачиваться и останавливаться.
            <br>
            <br>Подходит для:
            <br>• Те, кто хочет продолжать учиться
            <br>• Роллеры, завершившие уровень 2.
            <br>• Роллеры среднего уровня.
          </p>
        </div>
        <!-- Card 4 -->
        <div class="relative w-full h-[260px] flex items-center group">
          <!-- BG -->
          <img src="http://happywheels.local/wp-content/uploads/2024/02/Level-4.png" alt="HappyWheels Rolling Class Level 1" class="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 h-full aspect-square object-contain object-center duration-500 group-hover:opacity-40">
          <!-- TextOnHover -->
          <p class="text-sm text-white text-center opacity-0 relative duration-500 cursor-default group-hover:opacity-100 lg:text-base">
            <strong>Уровень 4</strong>
            <br>Наши курсы и уроки четвертого уровня предназначены для того, чтобы поднять ваши навыки катания на роликах на новую высоту. Эти классы были созданы, чтобы бросить вызов нашим роллерам. Изучите новые трюки, узнайте, как связать движения, чтобы улучшить плавность, и передовые техники.
            <br>
            <br>Подходит для:
            <br>• Любой, кто ищет вызов
            <br>• Роллеры, завершившие уровень 2 или 3.
            <br>• Роллеры среднего и опытного уровня
          </p>
        </div>
      </div>
    </div>
  </div>
</section>